from core.constants_games_manager import\
    HELP_CMD,\
    GAME_JOIN_CMD,\
    GAME_INITIATE_CMD,\
    GAME_START_CMD,\
    GAME_LOCK_CMD
    
from core.constants_game import MAX_PLAYERS, MIN_PLAYERS

ERR_MSG_WRONG_CMD_CHANNEL_COMB_TITTLE =\
'Не в цьому чаті!'

ERR_MSG_WRONG_CMD_CHANNEL_COMB_TEXT =\
'Ця команда не може бути виконано у цьому каналі.\n\
Щоб роздрукувати інструкцію використання Авалон бота,\
 будь ласка, використайте команду `' + HELP_CMD  + '`'

ERR_MSG_GAME_ALREADY_INITIATED_HERE_TITLE =\
'Набір гравців вже розпочато!'

ERR_MSG_GAME_ALREADY_INITIATED_HERE_TEXT =\
'На цьому сервері вже розпочатий набір гравців до гри!\n\
Щоб приєднатися до гри використайте команду `' + GAME_JOIN_CMD  + '`'

ERR_MSG_GAME_NOT_INITIATED_HERE_TITLE =\
'Немає куди приєднуватися :( !'

ERR_MSG_GAME_NOT_INITIATED_HERE_TEXT =\
'На цьому сервері немає набору на гру!\n\
Щоб створити гру використайте команду `' + GAME_INITIATE_CMD  + '`'

ERR_MSG_NO_GAME_TO_LOCK_TITLE =\
'На цьому сервері немає гри :( !'

ERR_MSG_NO_GAME_TO_LOCK_TEXT =\
'На цьому сервері немає розпочатої гри!\n\
Щоб створити гру використайте команду `' + GAME_INITIATE_CMD  + '`'

ERR_MSG_ONLY_MASTER_LOCKS_TITLE =\
'Тільки майстер!'

ERR_MSG_ONLY_MASTER_LOCKS_TEXT =\
'Лише майстер гри може її заблокувати!'

ERR_MSG_USER_ALREADY_IN_A_GAME_TITLE =\
'Ви вже берете участь у грі!'

ERR_MSG_USER_ALREADY_IN_A_GAME_TEXT =\
'Ви вже берете участь у одній з ігор.\n\
Одночасна участь одного гравця в декількох\
 іграх не підтримується.'

ERR_MSG_TOO_FEW_PLAYERS_TITLE =\
'Замало гравців!'

ERR_MSG_TOO_FEW_PLAYERS_TEXT =\
'Занадто мало гравців доєдналося до гри :( .\n\
Набір у гру не може бути зупинений,\
 допоки не набереться мінімальна кількість гравців: ' +\
str(MIN_PLAYERS)

ERR_MSG_TOO_MUCH_PLAYERS_TITLE =\
'Гра вже заповнена!'

ERR_MSG_TOO_MUCH_PLAYERS_TEXT =\
'До гри доєдналася максимальна кількість гравців.\n\
На жаль, максимальна кількість гравців рівна '\
+ str(MAX_PLAYERS)


ERR_MSG_ONLY_MASTER_STARTS_TITLE =\
'Тільки майстер!'

ERR_MSG_ONLY_MASTER_STARTS_TEXT =\
'Лише майстер гри може її розпочати!'


ERR_MSG_START_ONLY_IN_GAME_CH_TITLE =\
'Тільки в ігровому каналі!'

ERR_MSG_START_ONLY_IN_GAME_CH_TEXT =\
'Гру можна розпочати лише в ігровому каналі!\n\
Ви мали б отримати запрошення в канал у особисті повідомлення!'


ERR_MSG_NOT_IN_GAME_TITLE =\
'Не у грі :( !'

ERR_MSG_NOT_IN_GAME_TEXT =\
'{user_name}, ви не знаходитесь у жодній грі :( ,\
 тож не можете запустити заблоковану гру...\n\
Щоб отримати більше інформації, використайте команду `' + HELP_CMD  + '`'


ERR_MSG_NOT_IN_LOCKED_GAME_TITLE =\
'Не у заблокованій грі :( !'

ERR_MSG_NOT_IN_LOCKED_GAME_TEXT =\
'{user_name}, гра, у якій ви знаходитеся, не заблокована :( ,\
 тож не можете запустити цю гру...\n\
Щоб отримати більше інформації, використайте команду `' + HELP_CMD  + '`'


ERR_MSG_NOT_ALL_CONNECTED_TITLE =\
'Не всі приєдналися до сервера :( !'

ERR_MSG_NOT_ALL_CONNECTED_TEXT =\
'Не всі гравці приєдналися до сервера гри. \n\
А тут - не кидають нікого :) .\n\
Запрошення до сервера (і до гри) надійшли гравцям в особисті повідомлення.'

ERR_MSG_NOT_ALL_CONNECTED_VOICE_TITLE =\
'Не всі приєдналися до голосового чату :( !'

ERR_MSG_NOT_ALL_CONNECTED_VOICE_TEXT =\
'Не всі гравці приєдналися до голосового чату гри. \n\
А тут чекають усіх :) .\n\
Запрошення до чату надійшли гравцям в їхні особисті ігрові канали.'


INFO_MSG_CONNECTNESS_STATUS_TITLE =\
'Гравці що не приєднались'

INFO_MSG_CONNECTNESS_STATUS_TEXT =\
'Ось ті, на кого всі чекають:'

INFO_MSG_NOT_IN_GUILD_FIELD_NAME =\
'\nГравці, що не доєдналися до сервера: '

INFO_MSG_NOT_IN_VOICE_FIELD_NAME =\
'\nГравці, на що не увійшли у голосовий канал: '

INFO_MSG_GAME_INITIATED_TITLE =\
'Набір у гру розпочато!'

INFO_MSG_GAME_INITIATED_TEXT =\
'Щоб доєднатись до гри використайте команду `' + GAME_JOIN_CMD  + '`'

INFO_MSG_PARTY_LEADER_FIELD_NAME =\
'\nМайстер гри: '

INFO_MSG_OTHER_PALYERS_FIELD_NAME =\
'\nГравці, що доєдналися: '

INFO_MSG_FOOTER =\
('Мінімум гравців : ' 
+ str(MIN_PLAYERS) 
+ '. Максимум гравців:'
+ str(MAX_PLAYERS)
+ '. Набрано гравців: {number}')


INFO_MSG_GAME_LOCKED_TITLE =\
'Набір у гру закрито!'

INFO_MSG_GAME_LOCKED_TEXT =\
'Набір у гру закрито Майстром гри!\n\
Тепер Майстер може розпочати гру командою `' + GAME_START_CMD  + '`\n\
Але, тільки у ігровому каналі!\n\
Запрошення до каналу майстер (і інші :) ) може знайти в особистих повідомленнях :) '

GAME_MSG_WAITING_ALL =\
'Гра почнеться не за баром. Чекаємо поки доєднаються усі гравці...'


# Team voters interface
GATHERS_TEAM = '{team_leader} збирає таку команду ({num_selected} з {num_needed}): '
DO_YOU_APPROVE_TEAM = 'Схвалити цю команду?'

# Team leader interface
SELECTED_PLAYERS = 'Ви хочете взяти в команду цих гравців ({num_selected} з {num_needed}): '
TOO_MANY_PLAYERS = 'Обрано забагато гравців! Потрібно обрати {num_needed}.' 
TOO_FEW_PLAYERS  = 'Обрано замало гравців! Потрібно обрати {num_needed}.' 
PROPOSE_TEAM     = 'Запропонувати таку команду?'

VOTE_RESULT = 'Результати голосування (за команду {players_emjies_str})'

# Merlin shooting
MERLIN_NOT_SELECTED = 'Жоден гравець не позначений як Мерлін.'
MERLIN_SELECTED     = 'Ось хто позначений як Мерлін.'

ONLY_ONE_CAN_BE_MERLIN = 'Тільки один гравець може бути позначений як Мерлін!'
ONLY_ONE_CAN_BE_MERLIN = 'Гравець позначений як Мерлін. Зробити остаточний вибір?'


#========== Timer panel ======================================================#
TIMER_YOU_ARE_TALKING   = '❗ Ви говорите! ❗'
TIMER_X_IS_TALKING      = '📢 **Говорить {name}.** 📢'
TIMER_MERLIN_HUNT       = '📢 Полювання на Мерліна.'
TIMER_X_ARE_TALKING     = '📢 **Говорять {group}.'
TIMER_RED_PALYERS       = 'червоні гравці** 📢'
TIMER_ALL_PLAYERS       = 'усі гравці** 📢'
TIMER_TIME_LEFT         = '\n'
TIMER_LESS_THAN_X_LEFT  = '\n_Лишилось менше ніж {sec} секунд!_'
TIMER_TIME_HAS_ENDED_UP = '⏰ Час закінчився! Всі мовчимо! ⏰'
TIMER_X_PREPARS_TO_TALK = '🧠 _{name}_ готується говорити. 🧠'
TIMER_PREPARE_TO_TALK   = '❗ Приготуйтесь говорити ❗'
TIMER_NOT_STARTED_YET   = '⏲️ Тут буде ігровий таймер ⏲️'
#=============================================================================#



#========== Vote panel =======================================================#
VOTE_VOTE_FOR_PARTY_Q          = '▪️ **Відправити цих гравців у пригоду?**'
VOTE_WAINTING_FOR_OTHERS       = '▪️ **Гравці, які ще не визначилися:**'
VOTE_APPROVAL_RESULT           = '▪️ **Результати голосування:**'

VOTE_LEADER_TOO_MANY_PLAYERS_SELECTED =\
     '▪️ **Позначено забагато гравців ({sel} з {need}):**'
VOTE_LEADER_TOO_FEW_PLAYERS_SELECTED  =\
     '▪️ **Позначено замало гравців ({sel} з {need}):**'
VOTE_LEADER_SELECT_PLAYERS_RDY   =\
      '▪️ **Позначено {sel} з {need} гравців. Обрати їх?**'
VOTE_LEADER_SELECT_PLAYERS_TALKS =\
'▪️ **Позначено {sel} з {need} гравців.\
\n▪️ Ви зможете обрати їх коли всі скажуть своє слово.**'
VOTE_PLAYERS_SELECTED          = '▪️ **Потенційні герої ({sel} з {need}):**'

VOTE_MISSION_HAS_STARTED   = '▪️ **Пригода почалась!**'
VOTE_MISSION_NON_PARTY     = '▪️ **Наші герої вирішують долю пригоди!**'
VOTE_WAITING_4_OTHERS      = '▪️ **Чекаємо поки усі визначаться.**'
VOTE_CHOOSE_MISSION_RESULT = '▪️ **Оберіть результат пригоди:**'
VOTE_FAILED_MISSION        = '▪️ **Пригода завершилась невдачею... Результати:**'
VOTE_SUCCESS_MISSION       = '▪️ **Пригода була успішною! Результати:**'

VOTE_RED_SEEK_MERLIN        = '▪️ **Червоні шукають Мерліна.**'
VOTE_MERLIN_SELECTED        = '▪️ **Цей гравець позначений як Мерлін:**'
VOTE_HUNTER_SELECTS_MERLIN  = '▪️ **Ви позначаєте Мерліна.**'
VOTE_HUNTER_MERLIN_SELECTED = '▪️ **Гравець позначений як Мерлін. Стріляти?**'
VOTE_NO_ONE_SELECTED_AS_MERLIN = '▪️ **Мерліна не позначено.**'
VOTE_RED_SHOT_A_PLAYER      = '▪️ **Червоні вистрілили в цього гравця:**'
#=============================================================================#


#========== Selection panel ==================================================#
SEL_EMPTY_SELECTION = '        *******'
SEL_YOU_CHOOSE_PARTY         = '🗳️ **Ви обираєте гравців у пригоду:**'
SEL_YOU_HAVE_CHOSEN_PARTY    = '🗳️ **Ви обрали гравців у пригоду.**'
SEL_PLAYER_CHOOSES_PARTY     = '🗳️ **{} обирає гравців у пригоду.**'
SEL_PLAYER_HAVE_CHOSEN_PARTY = '🗳️ **{} обрав гравців у пригоду.**'

SEL_YOU_GUESS_MERLIN          = '🗳️ **Ви вгадуєте Мерліна:**'
SEL_YOU_HAVE_CHOSEN_MERLIN    = '🗳️ **Ви обрали Мерліна.**'
SEL_PLAYER_GUESSES_MERLIN     = '🗳️ **{} вгадує Мерліна.**'
SEL_PLAYER_HAVE_CHOSEN_MERLIN = '🗳️ **{} обрав Мерліна.**'
#=============================================================================#


#========== Secret info panel ================================================#
PUSH_EYE_TO_SEE_INFO        =\
     'Натисніть на Око (не своє), щоб відобразити секретну інформацію.'
#=============================================================================#


#========== Roles ============================================================#
SIMPLE_BLUE_ROLE_NAME = 'Вірний соратник Артура'
SIMPLE_RED_ROLE_NAME  = 'Мінйон Мордреда'

MERLIN_ROLE_NAME      = 'Мерлін'
MORGANA_ROLE_NAME     = 'Моргана'
PERSIVAL_ROLE_NAME    = 'Персіваль'
MORDRED_ROLE_NAME     = 'Мордред'
OBERON_ROLE_NAME      = 'Оберон'
ASSASSIN_ROLE_NAME    = 'Асасин'

MORGANA_OR_MERLIN_ROLE_NAME = 'Моргана або Мерлін'
#=============================================================================#

#========== Secret info ======================================================#
SECRET_INFO_HEADER =\
'📢 Секретна інформація'

SECRET_INFO_YOUR_ROLE =\
'Ваша роль - _**{role}**_. \nВаша команда - _**{team}**_'


OTHER_PLAYER_SECRET_INFO =\
'_**{role}**_. Команда - _**{team}**_'

OTHER_PLAYER_SECRET_INFO_NO_TEAM =\
"""_**{role}**_"""


BLUE_TEAM_NAME = 'Сині'
RED_TEAM_NAME  = 'Червоні'

NOT_READY_YET = 'Тут буде відома вам секретна інформація.'
#=============================================================================#

#========== Teams names ======================================================#
RED_TEAM_NAME  = 'Червоні'
BLUE_TEAM_NAME = 'Сині'
#=============================================================================#


#========== Temp table phrases ===============================================#
PLAYERS_ORDER     = 'Порядок гравців : '
MISSIONS_STATUSES = 'Статус місій         : '
VOTING_NUMBER     = 'Голосування #    : '
#=============================================================================#