# Створює екземпляр класу гри. Ініціює можливість приєднання до гри.
# Створює приватний чат для паті лідера. 
# В приватному чаті гра надає лідеру можливість обрати персонажів гри,
# залочити гру, розпочати гру і закінчити гру.
GAME_INITIATE_CMD = '$go_avalon'
GAME_JOIN_CMD     = '$join_avalon'

# Забороняє нові приєднання до гри. Може бути розлочена.
GAME_LOCK_CMD     = '$lock_avalon'

# Створює внутрішні дані (розподіл ролей, порядок ходу і т.д.),
# створює приватні канали для усіх гравців, які ініціювали приєднання до гри,
# і запускає першу пригоду.
GAME_START_CMD    = '$start_avalon'

# Має зупиняти усі тамери (і м'ютати гравців?)
GAME_PAUSE_CMD    = '$pause_avalon'

# Видаляє усі приватні чати, видаляє внутрішню інфу.
# Надсилає результати гри в приват кожному гравцю (?)
GAME_END_CMD      = '$end_avalon'

# Refresh command should be used when:
#   A) Приватний чат з гравцем видалений
#   Б) Одне з ігрових повідомлень видалене.
# Якщо команда використовується паті лідеров - гра має перестворити 
# приватні канали усіх гравців і повідомоення бота.
# Якщо використовується рядовим гравцем - тіж дії застосовуються до
# цього гравця і паті лідера.  
GAME_REFRESH_CMD  = 'refresh_avalon'

# Виводить довідкову інформацію по командах
HELP_CMD          = '$help_avalon'

AVALON_COMMANDS = [
    GAME_INITIATE_CMD,
    GAME_JOIN_CMD,
    GAME_LOCK_CMD,
    GAME_START_CMD,
    GAME_PAUSE_CMD,
    GAME_END_CMD,
    GAME_REFRESH_CMD,
    HELP_CMD
]